In [2]:
try:
    file = open('data.csv','x')
    file.close()
except:
    print("The file is already there!")

The file is already there!

In [5]:
import pandas as pd    #data manupulation-filter read,clean of data
df = pd.read_csv('data.csv')   #data frame
df

   sn   name  age        add       phone
0   1    Ram   35  Kathmandu  9846532699
1   2  Shyam   55   Lalitpur   659874233
2   3   Hari    5     Balkot  9876543222
3   4   John   79      Kapan   876543219
4   5  Nabin   77     Boudha  9876654332
5   6  Sabin   44    Hetauda   987644378

In [6]:
import pandas as pd    
df = pd.read_csv('data.csv', nrows = 4)   
df

   sn   name  age        add       phone
0   1    Ram   35  Kathmandu  9846532699
1   2  Shyam   55   Lalitpur   659874233
2   3   Hari    5     Balkot  9876543222
3   4   John   79      Kapan   876543219

In [7]:
import pandas as pd    
df = pd.read_csv('data.csv')   
df.head(4)        # from 1to 4 top to bottom

   sn   name  age        add       phone
0   1    Ram   35  Kathmandu  9846532699
1   2  Shyam   55   Lalitpur   659874233
2   3   Hari    5     Balkot  9876543222
3   4   John   79      Kapan   876543219

In [8]:
import pandas as pd    
df = pd.read_csv('data.csv')   
df.tail(4)

   sn   name  age      add       phone
2   3   Hari    5   Balkot  9876543222
3   4   John   79    Kapan   876543219
4   5  Nabin   77   Boudha  9876654332
5   6  Sabin   44  Hetauda   987644378

In [38]:
import pandas as pd    
df = pd.read_csv('data.csv', index_col = 'sn')   
df.head(4)  

# name age add phone - zero axis
# sn details one axis
# index_col is used to remove the auto gemnerated number as above -index_col = 'sn'

     name  age        add       phone
sn
1     Ram   35  Kathmandu  9846532699
2   Shyam   55   Lalitpur   659874233
3    Hari    5     Balkot  9876543222
4    John   79      Kapan   876543219

In [54]:
df = pd.read_csv('data.csv',index_col = 'sn', usecols = ['sn','name','phone'])  
df

EmptyDataError: No columns to parse from file

In [18]:
import pandas as pd
df = pd.read_csv('data.csv')
df.iloc[2:5]        # to import row  it is based on index

   sn   name  age     add       phone
2   3   Hari    5  Balkot  9876543222
3   4   John   79   Kapan   876543219
4   5  Nabin   77  Boudha  9876654332

In [21]:
import pandas as pd
df = pd.read_csv('data.csv')
df.iloc[2:5,0:4]      #index localizer- iloc

   sn   name  age     add
2   3   Hari    5  Balkot
3   4   John   79   Kapan
4   5  Nabin   77  Boudha

In [22]:
#loc     while using loc ndex_col must be defined, it is based on value
df = pd.read_csv('data.csv',index_col =   'sn')
df.loc[2:5]

     name  age       add       phone
sn
2   Shyam   55  Lalitpur   659874233
3    Hari    5    Balkot  9876543222
4    John   79     Kapan   876543219
5   Nabin   77    Boudha  9876654332

In [28]:
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['Hari':'Nabin']

       sn  age     add       phone
name
Hari    3    5  Balkot  9876543222
John    4   79   Kapan   876543219
Nabin   5   77  Boudha  9876654332

In [30]:
#filter
df = pd.read_csv('data.csv')
df['name']

0      Ram
1    Shyam
2     Hari
3     John
4    Nabin
5    Sabin
Name: name, dtype: object

In [31]:
df['name'] == 'Ram'      #searching name in the data

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [32]:
df[df['name'] == 'Ram']    # details of ram

   sn name  age        add       phone
0   1  Ram   35  Kathmandu  9846532699

In [33]:
df[df['add'] == 'Kathmandu']

   sn name  age        add       phone
0   1  Ram   35  Kathmandu  9846532699

In [34]:
df[df['age'] >= 60]

   sn   name  age     add       phone
3   4   John   79   Kapan   876543219
4   5  Nabin   77  Boudha  9876654332

In [36]:
df[(df['age'] >= 20) & (df['add'] =='Kathmandu')]

   sn name  age        add       phone
0   1  Ram   35  Kathmandu  9846532699

In [40]:
data = [['sn','name','age','add'],
       [1,'ram',34,'kathmandu'],
       [2,'shyam',22, 'Lalitpur'],
       [3,'hari',55,'Bhaktapur']]
data

[['sn', 'name', 'age', 'add'],
 [1, 'ram', 34, 'kathmandu'],
 [2, 'shyam', 22, 'Lalitpur'],
 [3, 'hari', 55, 'Bhaktapur']]

In [41]:
import csv
file = open('data2.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [42]:
import pandas as pd
df = pd.read_csv('data2.csv')
df

   sn   name  age        add
0   1    ram   34  kathmandu
1   2  shyam   22   Lalitpur
2   3   hari   55  Bhaktapur

In [43]:
data = {'name':['Ram','Shyam','Hari'],
       'age':[45,58,44,],
       'add':['Kathmandu','Lalitpur','Bhaktapur']}
data

{'name': ['Ram', 'Shyam', 'Hari'],
 'age': [45, 58, 44],
 'add': ['Kathmandu', 'Lalitpur', 'Bhaktapur']}

In [44]:
df = pd.DataFrame(data)  # convet to dataframe
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   58   Lalitpur
2   Hari   44  Bhaktapur

In [45]:
df.to_csv('data3.csv') # save the above file in this data

In [55]:
import csv
csv_colums = ['Name','Age','Address']
dict = [
    {'Name':'Hari','Age':35,'Address':'Kathmandu'},
    {'Name':'Shyam','Age':22,'Address':'Lalitpur'}
]
csvfile  = open("data.csv",'w')
writer = csv.DictWriter(csvfile, fieldnames=csv_colums)
writer.writeheader()
for data in dict:
    writer.writerow(data)
csvfile.close()

In [47]:
data1 = {'name':['Ram','Shyam','Hari'],
       'age':[45,58,44,],
       'add':['Kathmandu','Lalitpur','Bhaktapur']}
df1 = pd.DataFrame(data1)

data2 = {'name':['Rama','Shyama','Haris'],
       'age':[45,58,44,],
       'add':['Kathmandu','Lalitpur','Bhaktapur']}
df2 = pd.DataFrame(data2)
df = pd.concat([df1,df2])
df

     name  age        add
0     Ram   45  Kathmandu
1   Shyam   58   Lalitpur
2    Hari   44  Bhaktapur
0    Rama   45  Kathmandu
1  Shyama   58   Lalitpur
2   Haris   44  Bhaktapur

In [49]:
df = df.rename(columns ={'name':'Name','age':'Age'})
df

     Name  Age        add
0     Ram   45  Kathmandu
1   Shyam   58   Lalitpur
2    Hari   44  Bhaktapur
0    Rama   45  Kathmandu
1  Shyama   58   Lalitpur
2   Haris   44  Bhaktapur

In [50]:
df.shape  # defines rows and columns

(6, 3)

In [51]:
row, col = df.shape
print("No of rows = ",row)
print("No of cols =", col)

No of rows =  6
No of cols = 3

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   add     6 non-null      object
dtypes: int64(1), object(2)
memory usage: 192.0+ bytes